ai-cgs/shared-attention.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-02 Thu 19:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Shared Attention and Theory of Mind</title>
<meta name="author" content="shubhamkar" />
<meta name="generator" content="Org Mode" />
<meta charset="utf-8 h">
<meta name="viewport" content="width=device-width, initial-scale=1.0, shrink-to-fit=no">
<link rel="stylesheet" type="text/css" href="../others.css">

<link rel='stylesheet' href='styles.css'>
<link rel='stylesheet' type='text/css' href='https://fonts.googleapis.com/css?family=Droid+Sans' />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Shared Attention and Theory of Mind</h1>
<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> <a href="goal-dep-cat.html">Goal-Dependent Categorization</a> | <b>Next:</b> <a href="causality.html">Causality</a>
</p>
</div>

<p>
It is probable that human ability to think symbolically aka using categories developed in response to our need to communicate with each other. Language use involves symbols, and communication is only possible if the two parties involved in a communicative exchange have shared beliefs about what the linguistic symbols mean. Shared Attention and Theory of Mind are said to be important abilities necessary for language and culture acquisition (citations?). Theory of Mind deficits lead to autism, and in severe cases also hampers language learning. Autistic individuals can be remarkable in certain skills and abilities, yet may face difficulties in understanding social norms and appropriateness.
</p>

<p>
As such, research on flexible goal-dependent categorization needs to be augmented by research on theory of mind, unless we want our machines to be autistic. Interestingly, developing machines with theory of mind can also readily solve the <a href="https://en.wikipedia.org/wiki/AI_alignment">Alignment Problem</a>, because, then, the machines will readily understand not what humans say or do, but what we <i>intend</i> to say or do. Neurotypical children - even as young as one year old - can readily pick up intentions.
</p>

<p>
However, perhaps, inferring beliefs and desires from actions seems to require research on Causality.
</p>

<div class="org-center">
<p>
<b>Up:</b> <a href="../thoughts.html">AI and CogSci</a> | <b>Previous:</b> <a href="goal-dep-cat.html">Goal-Dependent Categorization</a> | <b>Next:</b> <a href="causality.html">Causality</a>
</p>
</div>
</div>
</body>
</html>
